# Homebrew Bundle file for managing applications

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Terminal emulators
cask "iterm2"

# Development tools
brew "git"
brew "gh"
brew "neovim"
brew "tmux"

# Shell and utilities
brew "zsh"
brew "starship"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "zoxide"

# Programming languages
brew "node"
brew "python@3.12"
brew "go"
brew "rust"

# Container tools
brew "docker"
brew "docker-compose"

# Other utilities
brew "jq"
brew "tree"
brew "wget"
brew "curl"